rSunnyWeb2/app/controllers/days_controller.rb

SELECT * FROM "days"
---
  def index
    @days = Day.all

SELECT * FROM "days" WHERE ("days"."id" = 1)
---
  def show
    @day = Day.find(params[:id])

SELECT * FROM "days" WHERE ("days"."id" = 22)
---
  def edit
    @day = Day.find(params[:id])

SELECT "days".id FROM "days" WHERE ("days"."date" = '2010-04-04') LIMIT 1
SELECT * FROM "months" WHERE (year_number = 2010 and month = 4) LIMIT 1
SELECT * FROM "years" WHERE (year = 2010) LIMIT 1
INSERT INTO "days" ("date", "csvData", "created_at", "updated_at", "sum_unit0", "sum_unit1", "month_id", "chart_array0", "chart_array1") VALUES('2010-04-03', 'sep=;
INSERT INTO "years" ("year", "sum_unit0", "sum_unit1", "created_at", "updated_at") VALUES(NULL, NULL, NULL, '2010-08-05 19:41:23', '2010-08-05 19:41:23')
UPDATE "years" SET "sum_unit0" = 0.0, "sum_unit1" = 0.0, "updated_at" = '2010-09-28 21:29:03' WHERE "id" = 1
INSERT INTO "months" ("month", "sum_unit0", "sum_unit1", "created_at", "updated_at", "year_number", "year_id") VALUES(4, NULL, NULL, '2010-08-05 19:41:24', '2010-08-05 19:41:24', 2010, 1)
UPDATE "months" SET "sum_unit0" = 0.0, "sum_unit1" = 0.0, "updated_at" = '2010-09-28 21:29:03' WHERE "id" = 1
---
  def create
    @day = Day.new(params[:day])
    @day.loadFileData(params[:csvData])
		month = Month.find(:first,:conditions => [ "year_number = ? and month = ?",@day.date.year,@day.date.month ])
		if(month == nil)
		 month = Month.new
		 month.year_number = @day.date.year
		 month.month = @day.date.month
		 year = Year.find(:first,:conditions => ["year = ?",@day.date.year])
		 if(year == nil)
			 year = Year.new
			 year.year = @day.date.year
			 year.save
		 end
		 month.year = year
		 month.save

SELECT * FROM "days" WHERE ("days".month_id = 1)
DELETE FROM "days" WHERE "id" = 1
---
  def destroy
    @day = Day.find(params[:id])
    @day.destroy