rSunnyWeb2/app/controllers/months_controller.rb

  def index
    @months = Month.all
---
SELECT * FROM "months"

  def show
    @month = Month.find(params[:id])
---
SELECT * FROM "months" WHERE ("months"."id" = 1)