rSunnyWeb2/app/controllers/years_controller.rb

  def index
    @years = Year.all
---
SELECT * FROM "years"

  def show
    @year = Year.find(params[:id])
---
SELECT * FROM "years" WHERE ("years"."id" = 1)